_Rarzrabotki/Rarus/USO2/AccumulationRegisters/уатЗаказыГрузоотправителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>уатЗаказыГрузоотправителей</Name>
			<Comment>(уат)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказГрузоотправителя</Name>
					<Comment>Только родительский грузы (не этапы)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/уатТипыТочекМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>уатТипыТочекМаршрута</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Погрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПромежуточныйПункт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разгрузка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/уатМаршрутныйЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>уатМаршрутныйЛист</Name>
			<Comment>(уат)</Comment>
			<BasedOn>
				<xr:Item>Document.уатЗаказГрузоотправителя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатЗаказыГрузоотправителей</xr:Item>
				<xr:Item>AccumulationRegister.уатОборотыПоМаршрутномуЛисту</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресНазначения</Name>
					<Comment>Адрес прибытия</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтправления</Name>
					<Comment>Адрес отправления</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыОперацийМаршрутныйЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель1</Name>
					<Comment>Водитель 1</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель2</Name>
					<Comment>Водитель 2</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВПути</Name>
					<Comment>Время в пути по маршрутному листу</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИВремяВыполнения</Name>
					<Comment>Дата выполнения фактическая</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИВремяОтправления</Name>
					<Comment>Дата отправления фактическая</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИВремяОтправленияПлан</Name>
					<Comment>Плановое время отправления</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИВремяВыполненияПлан</Name>
					<Comment>Плановое время выполнения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесБрутто</Name>
					<Comment>Суммарный вес груза, кг</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Comment>Общее количество мест</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Comment>Объем перевезенного груза</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расстояние</Name>
					<Comment>Протяженность маршрута, км</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник1</Name>
					<Comment>Сотрудник 1</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник2</Name>
					<Comment>Сотрудник 2</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СформированАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заказы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>GUIDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесБрутто</Name>
							<Comment>Вес груза в кг</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Время</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыполнения</Name>
							<Comment>Удалить</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияПоЗаказу</Name>
							<Comment>Единица измерения по заказу на ТС</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказГрузоотправителя</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМест</Name>
							<Comment>Количество мест</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Перевозимый груз</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Comment>Объем груза в м3</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрибытиеПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрибытиеФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пункт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расстояние</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоянка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипТочкиМаршрута</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатТипыТочекМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УбытиеФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/AccumulationRegisters/уатЗаказыГрузоотправителей/Ext/RecordSetModule.bsl
Перем мПериод          Экспорт; // Период движений
Перем мТаблицаДвижений Экспорт; // Таблица движений

Перем МетаданныеДокумента, МетаданныеТабЧасти, ИмяДокумента, ИмяТабличнойЧасти, ИмяТаблицы, СтруктураШапкиДокумента, Отказ, Заголовок; 

// Выполняет движения по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьДвижения() Экспорт

	Загрузить(мТаблицаДвижений);

КонецПроцедуры // ВыполнитьДвижения()

// Выполняет приход по регистру.
//
// Параметры:
//  Нет.
// 
Процедура ВыполнитьПриход() Экспорт
	
	Если НЕ ЗначениеЗаполнено(мПериод) тогда
		мПериод = ЭтотОбъект.Отбор.Регистратор.Значение.Дата;
	КонецЕсли;

	Для каждого текСтрока Из мТаблицаДвижений Цикл
		НоваяЗапись = Добавить();
		НоваяЗапись.ВидДвижения           = ВидДвиженияНакопления.Приход;
		НоваяЗапись.Период                = мПериод;
		НоваяЗапись.Регистратор           = ЭтотОбъект.Отбор.Регистратор.Значение;
		НоваяЗапись.Контрагент            = ТекСтрока.Контрагент;
		НоваяЗапись.ДоговорКонтрагента    = текСтрока.ДоговорКонтрагента;
		НоваяЗапись.ЗаказГрузоотправителя = текСтрока.ЗаказГрузоотправителя;
		НоваяЗапись.Пакет                 = текСтрока.Пакет;
		НоваяЗапись.Количество            = текСтрока.Количество;
	КонецЦикла; 
	Записать();
	
КонецПроцедуры

// Выполняет расход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьРасход() Экспорт
	
	Если НЕ ЗначениеЗаполнено(мПериод) тогда
		мПериод = ЭтотОбъект.Отбор.Регистратор.Значение.Дата;
	КонецЕсли;
	
	Для каждого текСтрока Из мТаблицаДвижений Цикл
		НоваяЗапись = Добавить();
		НоваяЗапись.ВидДвижения           = ВидДвиженияНакопления.Расход;
		НоваяЗапись.Период                = мПериод;
		НоваяЗапись.Регистратор           = ЭтотОбъект.Отбор.Регистратор.Значение;
		НоваяЗапись.Контрагент            = ТекСтрока.Контрагент;
		НоваяЗапись.ДоговорКонтрагента    = текСтрока.ДоговорКонтрагента;
		НоваяЗапись.ЗаказГрузоотправителя = текСтрока.ЗаказГрузоотправителя;
		НоваяЗапись.Пакет                 = ТекСтрока.Пакет;
		НоваяЗапись.Количество            = текСтрока.Количество;
	КонецЦикла; 
	// запись движений
	Записать();
	
КонецПроцедуры

// Процедура контролирует остаток по данному регистру по переданному документу
// и его табличной части. В случае недостатка товаров выставляется флаг отказа и 
// выдается сообщение.
//
// Параметры:
//  ДокументОбъект - объект проводимого документа, 
//  Параметры      - структура, содержащая значения параметров необходимых для контроля остатков
//  Отказ          - флаг отказа в проведении,
//  Заголовок      - строка, заголовок сообщения об ошибке проведения.
//
Процедура КонтрольОстатков(ДокументОбъект, ИмяТабЧасти, СтруктураШапки, ОтказПроведения, ЗаголовокСообщения) Экспорт
	
	Если ИмяТабЧасти <> "" Тогда  
		Если ДокументОбъект[ИмяТабЧасти].Количество()=0 Тогда //если в таб.части ничего нет - не надо проверять
			Возврат;
		КонецЕсли;
	КонецЕсли;

	ИмяТабличнойЧасти 		= ИмяТабЧасти;
	Отказ 					= ОтказПроведения;
   	СтруктураШапкиДокумента = СтруктураШапки;
	Заголовок 				= ЗаголовокСообщения;


	МетаданныеДокумента = ДокументОбъект.Метаданные();
	ИмяДокумента        = МетаданныеДокумента.Имя;

	Если ИмяТабЧасти <>"" Тогда
		ИмяТаблицы = ИмяДокумента + "." + СокрЛП(ИмяТабличнойЧасти);
	Иначе
		ИмяТаблицы = ИмяДокумента;
	КонецЕсли;

	Если ИмяТабЧасти <>"" Тогда
		МетаданныеТабЧасти       = МетаданныеДокумента.ТабличныеЧасти[ИмяТабЧасти];
	КонецЕсли;

	Если ИмяДокумента = "уатМаршрутныйЛист" Тогда
		КонтрольОстатков_МаршрутныйЛист(ДокументОбъект);
	Иначе
		Сообщить("Для документа "+ДокументОбъект+" не предусмотрен вызов процедуры 'Контроль остатков' модуля регистра 'Заказы на ТС'");
	КонецЕсли;
	
	ОтказПроведения = Отказ;
    ЗаголовокСообщения = Заголовок;

КонецПроцедуры // КонтрольОстатков()

Процедура КонтрольОстатков_МаршрутныйЛист(ДокументОбъект)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МаршрутныйЛист.ЗаказГрузоотправителя КАК ЗаказНаТС,
	|	МаршрутныйЛист.Номенклатура КАК Номенклатура,
	|	МаршрутныйЛист.КоличествоВЕдиницеХраненияОстатков КАК КоличествоДокументЕдХрОстатков,
	|	МаршрутныйЛист.Количество КАК КоличествоДокумент,
	|	МаршрутныйЛист.ЕдиницаИзмерения КАК ЕдиницаИзмеренияДокумент,
	|	ЕСТЬNULL(уатЗаказыНаТСОстатки.КоличествоОстаток, 0) КАК КоличествоОстатокЗаказ,
	|	ЕСТЬNULL(уатЗаказыНаТСОстатки.ЕдиницаИзмерения, МаршрутныйЛист.ЕдиницаИзмеренияПоЗаказу) КАК ЕдиницаИзмеренияЗаказ,
	|	МаршрутныйЛист.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаХраненияОстатков
	|ПОМЕСТИТЬ втЗаказы
	|ИЗ
	|	(ВЫБРАТЬ
	|		уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
	|		уатМаршрутныйЛистЗаказы.Номенклатура КАК Номенклатура,
	|		СУММА(уатМаршрутныйЛистЗаказы.Количество) КАК Количество,
	|		уатМаршрутныйЛистЗаказы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		ЕСТЬNULL(СУММА(ВЫРАЗИТЬ(уатМаршрутныйЛистЗаказы.Количество КАК ЧИСЛО(15, 3))), 0) * ВЫБОР
	|			КОГДА уатМаршрутныйЛистЗаказы.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|				ТОГДА 1
	|			ИНАЧЕ ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1)
	|		КОНЕЦ КАК КоличествоВЕдиницеХраненияОстатков,
	|		уатМаршрутныйЛистЗаказы.ЕдиницаИзмеренияПоЗаказу КАК ЕдиницаИзмеренияПоЗаказу
	|	ИЗ
	|		Документ.уатМаршрутныйЛист.Заказы КАК уатМаршрутныйЛистЗаказы
	|	ГДЕ
	|		уатМаршрутныйЛистЗаказы.Ссылка = &СсылкаМаршрутныйЛист
	|		И уатМаршрутныйЛистЗаказы.ТипТочкиМаршрута = &ТипТочкиМаршрутаРазгрузка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя,
	|		уатМаршрутныйЛистЗаказы.Номенклатура,
	|		уатМаршрутныйЛистЗаказы.ЕдиницаИзмерения,
	|		уатМаршрутныйЛистЗаказы.ЕдиницаИзмеренияПоЗаказу) КАК МаршрутныйЛист
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уатЗаказыГрузоотправителей.Остатки КАК уатЗаказыНаТСОстатки
	|		ПО МаршрутныйЛист.ЗаказГрузоотправителя.Контрагент = уатЗаказыНаТСОстатки.Контрагент
	|			И МаршрутныйЛист.ЗаказГрузоотправителя = уатЗаказыНаТСОстатки.ЗаказГрузоотправителя
	|			И МаршрутныйЛист.Номенклатура = уатЗаказыНаТСОстатки.Номенклатура
	|			И МаршрутныйЛист.ЕдиницаИзмеренияПоЗаказу = уатЗаказыНаТСОстатки.ЕдиницаИзмерения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЗаказы.ЗаказНаТС КАК ЗаказНаТС,
	|	втЗаказы.Номенклатура КАК Номенклатура,
	|	втЗаказы.КоличествоДокументЕдХрОстатков КАК КоличествоДокументЕдХрОстатков,
	|	втЗаказы.КоличествоДокумент КАК КоличествоДокумент,
	|	втЗаказы.ЕдиницаИзмеренияДокумент КАК ЕдиницаИзмеренияДокумент,
	|	втЗаказы.КоличествоОстатокЗаказ КАК КоличествоОстатокЗаказ,
	|	втЗаказы.ЕдиницаИзмеренияЗаказ КАК ЕдиницаИзмеренияЗаказ,
	|	втЗаказы.ЕдиницаХраненияОстатков КАК ЕдиницаХраненияОстатков,
	|	ЕСТЬNULL(уатЗаказыГрузоотправителей.Регистратор, ЗНАЧЕНИЕ(Документ.уатМаршрутныйЛист.ПустаяСсылка)) КАК Регистратор
	|ИЗ
	|	втЗаказы КАК втЗаказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уатЗаказыГрузоотправителей КАК уатЗаказыГрузоотправителей
	|		ПО втЗаказы.ЗаказНаТС = уатЗаказыГрузоотправителей.ЗаказГрузоотправителя
	|			И (ТИПЗНАЧЕНИЯ(уатЗаказыГрузоотправителей.Регистратор) = ТИП(Документ.уатМаршрутныйЛист))";
		
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"уатМаршрутныйЛистЗаказы.ЕдиницаИзмерения",
			"уатМаршрутныйЛистЗаказы.Номенклатура"));
			
	Запрос.УстановитьПараметр("СсылкаМаршрутныйЛист",		ДокументОбъект.Ссылка);
	Запрос.УстановитьПараметр("ТипТочкиМаршрутаРазгрузка",  Перечисления.уатТипыТочекМаршрута.Разгрузка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка          = РезультатЗапроса.Выгрузить();
	тчВыборка        = Выборка.Скопировать();
	тчВыборка.Свернуть("ЗаказНаТС, Номенклатура, ЕдиницаИзмеренияЗаказ, ЕдиницаХраненияОстатков, КоличествоОстатокЗаказ, КоличествоДокументЕдХрОстатков");
	
	СтрокаСообщения = "";
	Для Каждого ТекСтрока Из тчВыборка Цикл
		КоличествоПревышение = ТекСтрока.КоличествоДокументЕдХрОстатков - ТекСтрока.КоличествоОстатокЗаказ; //превышение в единице хранения остатков
		Если КоличествоПревышение > 0 Тогда
			ДетальнаяВыборка = Выборка.НайтиСтроки(Новый Структура("ЗаказНаТС, Номенклатура, ЕдиницаИзмеренияЗаказ, ЕдиницаХраненияОстатков", ТекСтрока.ЗаказНаТС, ТекСтрока.Номенклатура, ТекСтрока.ЕдиницаИзмеренияЗаказ, ТекСтрока.ЕдиницаХраненияОстатков));
			Если ДетальнаяВыборка.Количество() > 0 И ЗначениеЗаполнено(ДетальнаяВыборка[0].Регистратор) Тогда
				СтрокаСообщения = "" + Символы.Таб + НСтр("en='Order for trucking:';ru='Заказ на ТС:'") + уатОбщегоНазначенияТиповые.уатСформироватьЗаголовокДокумента(ТекСтрока.ЗаказНаТС)+ " " + НСтр("en='by products and services:';ru='по номенклатуре:'") + " '" + ТекСтрока.Номенклатура  + "'";
				СтрокаСообщения = СтрокаСообщения + " " + НСтр("en='already posted in Routing lists:';ru='уже размещен в Маршрутных листах:'");
			Иначе
				СтрокаСообщения = "" + Символы.Таб + НСтр("en='Exceeded quantity for:';ru='Превышено количество для:'") + " " + ТекСтрока.ЗаказНаТС + " " + НСтр("en='by products and services:';ru='по номенклатуре:'") + " '" + ТекСтрока.Номенклатура  + "'";
			КонецЕсли;
			Для Каждого ТекМЛ Из ДетальнаяВыборка Цикл
				Если ЗначениеЗаполнено(ТекМЛ.Регистратор) Тогда
					СтрокаСообщения = СтрокаСообщения + Символы.ПС + уатОбщегоНазначенияТиповые.уатСформироватьЗаголовокДокумента(ТекМЛ.Регистратор);
				КонецЕсли;
			КонецЦикла;
			Если ТекСтрока.ЕдиницаИзмеренияЗаказ <> Неопределено Тогда
				СтрокаСообщения = СтрокаСообщения + Символы.ПС
				+ НСтр("en='Remain:';ru='Доступный остаток:'") + " " + ТекСтрока.КоличествоОстатокЗаказ + " " + ТекСтрока.ЕдиницаИзмеренияЗаказ;
			Иначе
				СтрокаСообщения = СтрокаСообщения  + Символы.ПС
				+ НСтр("en='Remain:';ru='Доступный остаток:'") + " " + ТекСтрока.КоличествоОстатокЗаказ + ".";
			КонецЕсли;
			уатОбщегоНазначенияТиповые.СообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
